# รายชื่อรหัสพรรคทั้งหมด (List)
PARTY_IDS = ['001', '002', '013', '022', '034', '045', '055', '056', '063', '076', '091', '109', '112', '118', '124', '129', '133', '145', '147', '153', '154', '155', '157', '170', '173', '174', '175', '178', '181', '183', '184', '185', '186', '187', '188', '189', '192', '193', '198', '203', '204', '205', '206', '211', '217', '218', '221', '222', '224', '226', '227', '229', '228', '230', '234', '235', '237', '238', '240', '241', '242', '244', '245', '246', '247', '249', '250', '251', '252', '253', '254', '255', '256', '257', '258']

# ชื่อพรรคภาษาไทย (List)
PARTY_NAMES_TH = ['ประชาธิปัตย์', 'ประชากรไทย', 'ความหวังใหม่', 'เครือข่ายชาวนาแห่งประเทศไทย', 'เพื่อไทย', 'ชาติพัฒนา', 'ชาติไทยพัฒนา', 'อนาคตไทย', 'ภูมิใจไทย', 'สังคมประชาธิปไตยไทย', 'รักชาติ', 'ประชาธิปไตยใหม่', 'พลังบูรพา', 'ครูไทยเพื่อประชาชน', 'พลังท้องถิ่นไท', 'ประชาชน', 'ไทยก้าวใหม่', 'เสรีรวมไทย', 'รักษ์ธรรม', 'พลังประชาธิปไตย', 'พลังสุราษฎร์', 'พลังไทยรักชาติ', 'เพื่อชีวิตใหม่', 'ทางเลือกใหม่', 'เศรษฐกิจ', 'สร้างอนาคตไทย', 'พลังธรรมใหม่', 'ไทยธรรม', 'รวมพลัง', 'ไทยพร้อม', 'ปวงชนไทย', 'เพื่อชาติไทย', 'พร้อมพัฒนา', 'ประชาชาติ', 'แผ่นดินธรรม', 'คลองไทย', 'พลังประชารัฐ', 'เศรษฐกิจใหม่', 'พลังสังคม', 'เป็นธรรม', 'พลังเพื่อไทย', 'ประชาไทย', 'กรีน', 'วิชชั่นใหม่', 'พลวัต', 'กล้าธรรม', 'ไทยรวมไทย', 'กล้า', 'ฟิวชัน', 'พลังสังคมใหม่', 'ไทยสร้างไทย', 'รวมไทยสร้างชาติ', 'มิติใหม่', 'ไทยสมาร์ท', 'ไทยภักดี', 'ไทยพิทักษ์ธรรม', 'ไทยชนะ', 'ไทรวมพลัง', 'ราษฎร์วิถี', 'โอกาสใหม่', 'ท้องที่ไทย', 'ใหม่', 'แรงงานสร้างชาติ', 'ไทยก้าวหน้า', 'ตะวันใหม่', 'พร้อม', 'รวมใจไทย', 'สัมมาธิปไตย', 'รักภูเก็ต', 'ประชาอาสาชาติ', 'ไทยทรัพย์ทวี', 'รวมพลังประชาชน', 'อนาคตไกล', 'ยางพาราไทย', 'เพื่อบ้านเมือง']

# Dictionary ค้นหาข้อมูลพรรคจากรหัส
PARTY_DICT = {
    "001": {
        "th": "ประชาธิปัตย์",
        "href": "/party-info/1"
    },
    "002": {
        "th": "ประชากรไทย",
        "href": "/party-info/2"
    },
    "013": {
        "th": "ความหวังใหม่",
        "href": "/party-info/6"
    },
    "022": {
        "th": "เครือข่ายชาวนาแห่งประเทศไทย",
        "href": "/party-info/7"
    },
    "034": {
        "th": "เพื่อไทย",
        "href": "/party-info/8"
    },
    "045": {
        "th": "ชาติพัฒนา",
        "href": "/party-info/10"
    },
    "055": {
        "th": "ชาติไทยพัฒนา",
        "href": "/party-info/12"
    },
    "056": {
        "th": "อนาคตไทย",
        "href": "/party-info/13"
    },
    "063": {
        "th": "ภูมิใจไทย",
        "href": "/party-info/15"
    },
    "076": {
        "th": "สังคมประชาธิปไตยไทย",
        "href": "/party-info/17"
    },
    "091": {
        "th": "รักชาติ",
        "href": "/party-info/21"
    },
    "109": {
        "th": "ประชาธิปไตยใหม่",
        "href": "/party-info/24"
    },
    "112": {
        "th": "พลังบูรพา",
        "href": "/party-info/25"
    },
    "118": {
        "th": "ครูไทยเพื่อประชาชน",
        "href": "/party-info/28"
    },
    "124": {
        "th": "พลังท้องถิ่นไท",
        "href": "/party-info/30"
    },
    "129": {
        "th": "ประชาชน",
        "href": "/party-info/32"
    },
    "133": {
        "th": "ไทยก้าวใหม่",
        "href": "/party-info/33"
    },
    "145": {
        "th": "เสรีรวมไทย",
        "href": "/party-info/38"
    },
    "147": {
        "th": "รักษ์ธรรม",
        "href": "/party-info/39"
    },
    "153": {
        "th": "พลังประชาธิปไตย",
        "href": "/party-info/44"
    },
    "154": {
        "th": "พลังสุราษฎร์",
        "href": "/party-info/45"
    },
    "155": {
        "th": "พลังไทยรักชาติ",
        "href": "/party-info/46"
    },
    "157": {
        "th": "เพื่อชีวิตใหม่",
        "href": "/party-info/48"
    },
    "170": {
        "th": "ทางเลือกใหม่",
        "href": "/party-info/59"
    },
    "173": {
        "th": "เศรษฐกิจ",
        "href": "/party-info/62"
    },
    "174": {
        "th": "สร้างอนาคตไทย",
        "href": "/party-info/63"
    },
    "175": {
        "th": "พลังธรรมใหม่",
        "href": "/party-info/64"
    },
    "178": {
        "th": "ไทยธรรม",
        "href": "/party-info/67"
    },
    "181": {
        "th": "รวมพลัง",
        "href": "/party-info/70"
    },
    "183": {
        "th": "ไทยพร้อม",
        "href": "/party-info/72"
    },
    "184": {
        "th": "ปวงชนไทย",
        "href": "/party-info/73"
    },
    "185": {
        "th": "เพื่อชาติไทย",
        "href": "/party-info/74"
    },
    "186": {
        "th": "พร้อมพัฒนา",
        "href": "/party-info/75"
    },
    "187": {
        "th": "ประชาชาติ",
        "href": "/party-info/76"
    },
    "188": {
        "th": "แผ่นดินธรรม",
        "href": "/party-info/77"
    },
    "189": {
        "th": "คลองไทย",
        "href": "/party-info/78"
    },
    "192": {
        "th": "พลังประชารัฐ",
        "href": "/party-info/81"
    },
    "193": {
        "th": "เศรษฐกิจใหม่",
        "href": "/party-info/82"
    },
    "198": {
        "th": "พลังสังคม",
        "href": "/party-info/87"
    },
    "203": {
        "th": "เป็นธรรม",
        "href": "/party-info/92"
    },
    "204": {
        "th": "พลังเพื่อไทย",
        "href": "/party-info/93"
    },
    "205": {
        "th": "ประชาไทย",
        "href": "/party-info/94"
    },
    "206": {
        "th": "กรีน",
        "href": "/party-info/95"
    },
    "211": {
        "th": "วิชชั่นใหม่",
        "href": "/party-info/100"
    },
    "217": {
        "th": "พลวัต",
        "href": "/party-info/119"
    },
    "218": {
        "th": "กล้าธรรม",
        "href": "/party-info/121"
    },
    "221": {
        "th": "ไทยรวมไทย",
        "href": "/party-info/123"
    },
    "222": {
        "th": "กล้า",
        "href": "/party-info/124"
    },
    "224": {
        "th": "ฟิวชัน",
        "href": "/party-info/126"
    },
    "226": {
        "th": "พลังสังคมใหม่",
        "href": "/party-info/128"
    },
    "227": {
        "th": "ไทยสร้างไทย",
        "href": "/party-info/129"
    },
    "229": {
        "th": "รวมไทยสร้างชาติ",
        "href": "/party-info/130"
    },
    "228": {
        "th": "มิติใหม่",
        "href": "/party-info/131"
    },
    "230": {
        "th": "ไทยสมาร์ท",
        "href": "/party-info/132"
    },
    "234": {
        "th": "ไทยภักดี",
        "href": "/party-info/136"
    },
    "235": {
        "th": "ไทยพิทักษ์ธรรม",
        "href": "/party-info/137"
    },
    "237": {
        "th": "ไทยชนะ",
        "href": "/party-info/139"
    },
    "238": {
        "th": "ไทรวมพลัง",
        "href": "/party-info/140"
    },
    "240": {
        "th": "ราษฎร์วิถี",
        "href": "/party-info/142"
    },
    "241": {
        "th": "โอกาสใหม่",
        "href": "/party-info/143"
    },
    "242": {
        "th": "ท้องที่ไทย",
        "href": "/party-info/144"
    },
    "244": {
        "th": "ใหม่",
        "href": "/party-info/146"
    },
    "245": {
        "th": "แรงงานสร้างชาติ",
        "href": "/party-info/147"
    },
    "246": {
        "th": "ไทยก้าวหน้า",
        "href": "/party-info/148"
    },
    "247": {
        "th": "ตะวันใหม่",
        "href": "/party-info/149"
    },
    "249": {
        "th": "พร้อม",
        "href": "/party-info/151"
    },
    "250": {
        "th": "รวมใจไทย",
        "href": "/party-info/152"
    },
    "251": {
        "th": "สัมมาธิปไตย",
        "href": "/party-info/153"
    },
    "252": {
        "th": "รักภูเก็ต",
        "href": "/party-info/154"
    },
    "253": {
        "th": "ประชาอาสาชาติ",
        "href": "/party-info/155"
    },
    "254": {
        "th": "ไทยทรัพย์ทวี",
        "href": "/party-info/156"
    },
    "255": {
        "th": "รวมพลังประชาชน",
        "href": "/party-info/157"
    },
    "256": {
        "th": "อนาคตไกล",
        "href": "/party-info/162"
    },
    "257": {
        "th": "ยางพาราไทย",
        "href": "/party-info/163"
    },
    "258": {
        "th": "เพื่อบ้านเมือง",
        "href": "/party-info/164"
    }
}
