import os
from dotenv import load_dotenv
from pathlib import Path

load_dotenv()

# Setup Google Drive
GDRIVE_ROOT_FOLDER_ID = os.getenv("GDRIVE_ROOT_FOLDER_ID")

# Setup Master Data
MASTER_CANDIDATES = [
    "นายอรรถพล โต๋วสัจจา",
    "นายชาดา ไทยเศรษฐ์",
    "นางสาวสุชาดา บัวพันธ์",
    "ร.ต.ศึกษา ฟุ้งเฟื่อง ร.น.",
    "นางสุพรรณษา นันทา"
]

MASTER_PARTIES = [
    "ไทยทรัพย์ทวี", "เพื่อชาติไทย", "ใหม่", "มิติใหม่", "รวมใจไทย", 
    "รวมไทยสร้างชาติ", "พลวัต", "ประชาธิปไตยใหม่", "เพื่อไทย", "ทางเลือกใหม่", 
    "เศรษฐกิจ", "เสรีรวมไทย", "รวมพลังประชาชน", "ท้องที่ไทย", "อนาคตไทย",
    "พลังเพื่อไทย", "ไทยชนะ", "พลังสังคมใหม่", "สังคมประชาธิปไตยไทย", "ฟิวชัน", 
    "ไทรวมพลัง", "ก้าวอิสระ", "ปวงชนไทย", "วิชชั่นใหม่", "เพื่อชีวิตใหม่", 
    "คลองไทย", "ประชาธิปัตย์", "ไทยก้าวหน้า", "ไทยภักดี", "แรงงานสร้างชาติ", 
    "ประชากรไทย", "ครูไทยเพื่อประชาชน", "ประชาชาติ", "สรางอนาคตไทย", "รักชาติ", 
    "ไทยพร้อม", "ภูมิใจไทย", "พลังธรรมใหม่", "กรีน", "ไทยธรรม", 
    "แผ่นดินธรรม", "กล้าธรรม", "พลังประชารัฐ", "โอกาสใหม่", "เป็นธรรม", 
    "ประชาชน", "ประชาไทย", "ไทยสร้างไทย", "ไทยก้าวใหม่", "ประชาอาสาชาติ",  
    "พร้อม", "เครือข่ายชาวนาแห่งประเทศไทย", "ไทยพิทักษ์ธรรม", "ความหวังใหม่", "ไทยรวมไทย", 
    "เพื่อบ้านเมือง", "พลังไทยรักชาติ" 
]

# Setup Path and Output
BASE_OUTPUT_DIR = Path("/opt/airflow/output_data") if os.getenv("AIRFLOW_HOME") else Path("output_data")